{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[BOS]": 2,
      "[EOS]": 3,
      "\"": 4,
      "%": 5,
      "'": 6,
      "(": 7,
      ")": 8,
      "*": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      ":": 24,
      "<": 25,
      "=": 26,
      ">": 27,
      "@": 28,
      "A": 29,
      "B": 30,
      "C": 31,
      "D": 32,
      "E": 33,
      "F": 34,
      "G": 35,
      "H": 36,
      "I": 37,
      "K": 38,
      "M": 39,
      "N": 40,
      "O": 41,
      "P": 42,
      "R": 43,
      "S": 44,
      "T": 45,
      "U": 46,
      "V": 47,
      "W": 48,
      "_": 49,
      "a": 50,
      "b": 51,
      "c": 52,
      "d": 53,
      "e": 54,
      "f": 55,
      "g": 56,
      "h": 57,
      "i": 58,
      "j": 59,
      "k": 60,
      "l": 61,
      "m": 62,
      "n": 63,
      "o": 64,
      "p": 65,
      "q": 66,
      "r": 67,
      "s": 68,
      "t": 69,
      "u": 70,
      "v": 71,
      "w": 72,
      "x": 73,
      "y": 74,
      "z": 75,
      "{": 76,
      "}": 77,
      "Ċ": 78,
      "č": 79,
      "Ġ": 80,
      "čĊ": 81,
      "er": 82,
      "02": 83,
      "in": 84,
      "on": 85,
      "at": 86,
      "ed": 87,
      "or": 88,
      "re": 89,
      "en": 90,
      "Ġs": 91,
      "al": 92,
      "Ġt": 93,
      "ce": 94,
      "10": 95,
      "le": 96,
      "03": 97,
      "202": 98,
      "db": 99,
      "id": 100,
      "ra": 101,
      "st": 102,
      "Ġ\"": 103,
      "2026": 104,
      "ab": 105,
      "is": 106,
      "lo": 107,
      "ut": 108,
      "Ġc": 109,
      "Ġm": 110,
      "Ġre": 111,
      "Ġ10": 112,
      "**": 113,
      "12": 114,
      "as": 115,
      "mp": 116,
      "us": 117,
      "Ġp": 118,
      "Ġ2026": 119,
      "=\"": 120,
      "ct": 121,
      "ion": 122,
      "ice": 123,
      "me": 124,
      "ne": 125,
      "ror": 126,
      "tr": 127,
      "Ġd": 128,
      "Ġl": 129,
      "ĠĠ": 130,
      "Ġin": 131,
      "erv": 132,
      "Ġto": 133,
      "\",": 134,
      "ER": 135,
      "Er": 136,
      "ad": 137,
      "an": 138,
      "sg": 139,
      "onne": 140,
      "att": 141,
      "ort": 142,
      "Ġserv": 143,
      "Ġmsg": 144,
      "user": 145,
      "Error": 146,
      "onnect": 147,
      "Ġservice": 148,
      "35": 149,
      "FO": 150,
      "IN": 151,
      "OR": 152,
      "ROR": 153,
      "ac": 154,
      "ex": 155,
      "emp": 156,
      "he": 157,
      "ile": 158,
      "ime": 159,
      "led": 160,
      "no": 161,
      "ost": 162,
      "out": 163,
      "ue": 164,
      "up": 165,
      "Ġatt": 166,
      "ers": 167,
      "ent": 168,
      "load": 169,
      "Ġconnect": 170,
      "123": 171,
      "ase": 172,
      "ERROR": 173,
      "INFO": 174,
      "empt": 175,
      "Ġattempt": 176,
      "\":": 177,
      "()": 178,
      "00": 179,
      "File": 180,
      "ag": 181,
      "ai": 182,
      "ap": 183,
      "ar": 184,
      "ain": 185,
      "aut": 186,
      "cs": 187,
      "dat": 188,
      "host": 189,
      "it": 190,
      "ken": 191,
      "py": 192,
      "port": 193,
      "to": 194,
      "Ġb": 195,
      "Ġf": 196,
      "Ġo": 197,
      "Ġis": 198,
      "Ġuser": 199,
      "ĠFile": 200,
      "ine": 201,
      "ces": 202,
      "abase": 203,
      "log": 204,
      "Ġretr": 205,
      "****": 206,
      "Ġline": 207,
      "ĠĠĠ": 208,
      "imeout": 209,
      "not": 210,
      "upload": 211,
      "age": 212,
      "app": 213,
      "auth": 214,
      "32": 215,
      "33": 216,
      "432": 217,
      "5432": 218,
      "600": 219,
      "AR": 220,
      "BU": 221,
      "Con": 222,
      "DE": 223,
      "Tra": 224,
      "Timeout": 225,
      "WAR": 226,
      "ara": 227,
      "amp": 228,
      "cat": 229,
      "cac": 230,
      "de": 231,
      "ee": 232,
      "fi": 233,
      "gra": 234,
      "iz": 235,
      "ns": 236,
      "nal": 237,
      "ph": 238,
      "pon": 239,
      "pas": 240,
      "que": 241,
      "su": 242,
      "sw": 243,
      "spon": 244,
      "tl": 245,
      "ter": 246,
      "var": 247,
      "yin": 248,
      "Ġ'": 249,
      "Ġ/": 250,
      "ĠS": 251,
      "Ġw": 252,
      "Ġal": 253,
      "Ġex": 254,
      "Ġnot": 255,
      "atabase": 256,
      "ord": 257,
      "report": 258,
      "Ġsh": 259,
      "Ġsee": 260,
      "Ġtra": 261,
      "abc": 262,
      "Ġcal": 263,
      "Ġmain": 264,
      "Ġrespon": 265,
      "Ġpara": 266,
      "Ġdid": 267,
      "Ġtoken": 268,
      "ack": 269,
      "Ġconnection": 270,
      "ailed": 271,
      "csv": 272,
      "data": 273,
      "Ġof": 274,
      "login": 275,
      "Ġretryin": 276,
      "uploads": 277,
      "BUG": 278,
      "DEBUG": 279,
      "TimeoutError": 280,
      "WARN": 281,
      "cache": 282,
      "graph": 283,
      "passw": 284,
      "quest": 285,
      "Ġrespond": 286,
      "Ġparagraph": 287,
      "Ġtokeniz": 288,
      "Ġretrying": 289,
      "password": 290
    },
    "merges": [
      [
        "č",
        "Ċ"
      ],
      [
        "e",
        "r"
      ],
      [
        "0",
        "2"
      ],
      [
        "i",
        "n"
      ],
      [
        "o",
        "n"
      ],
      [
        "a",
        "t"
      ],
      [
        "e",
        "d"
      ],
      [
        "o",
        "r"
      ],
      [
        "r",
        "e"
      ],
      [
        "e",
        "n"
      ],
      [
        "Ġ",
        "s"
      ],
      [
        "a",
        "l"
      ],
      [
        "Ġ",
        "t"
      ],
      [
        "c",
        "e"
      ],
      [
        "1",
        "0"
      ],
      [
        "l",
        "e"
      ],
      [
        "0",
        "3"
      ],
      [
        "2",
        "02"
      ],
      [
        "d",
        "b"
      ],
      [
        "i",
        "d"
      ],
      [
        "r",
        "a"
      ],
      [
        "s",
        "t"
      ],
      [
        "Ġ",
        "\""
      ],
      [
        "202",
        "6"
      ],
      [
        "a",
        "b"
      ],
      [
        "i",
        "s"
      ],
      [
        "l",
        "o"
      ],
      [
        "u",
        "t"
      ],
      [
        "Ġ",
        "c"
      ],
      [
        "Ġ",
        "m"
      ],
      [
        "Ġ",
        "re"
      ],
      [
        "Ġ",
        "10"
      ],
      [
        "*",
        "*"
      ],
      [
        "1",
        "2"
      ],
      [
        "a",
        "s"
      ],
      [
        "m",
        "p"
      ],
      [
        "u",
        "s"
      ],
      [
        "Ġ",
        "p"
      ],
      [
        "Ġ",
        "2026"
      ],
      [
        "=",
        "\""
      ],
      [
        "c",
        "t"
      ],
      [
        "i",
        "on"
      ],
      [
        "i",
        "ce"
      ],
      [
        "m",
        "e"
      ],
      [
        "n",
        "e"
      ],
      [
        "r",
        "or"
      ],
      [
        "t",
        "r"
      ],
      [
        "Ġ",
        "d"
      ],
      [
        "Ġ",
        "l"
      ],
      [
        "Ġ",
        "Ġ"
      ],
      [
        "Ġ",
        "in"
      ],
      [
        "er",
        "v"
      ],
      [
        "Ġt",
        "o"
      ],
      [
        "\"",
        ","
      ],
      [
        "E",
        "R"
      ],
      [
        "E",
        "r"
      ],
      [
        "a",
        "d"
      ],
      [
        "a",
        "n"
      ],
      [
        "s",
        "g"
      ],
      [
        "on",
        "ne"
      ],
      [
        "at",
        "t"
      ],
      [
        "or",
        "t"
      ],
      [
        "Ġs",
        "erv"
      ],
      [
        "Ġm",
        "sg"
      ],
      [
        "us",
        "er"
      ],
      [
        "Er",
        "ror"
      ],
      [
        "onne",
        "ct"
      ],
      [
        "Ġserv",
        "ice"
      ],
      [
        "3",
        "5"
      ],
      [
        "F",
        "O"
      ],
      [
        "I",
        "N"
      ],
      [
        "O",
        "R"
      ],
      [
        "R",
        "OR"
      ],
      [
        "a",
        "c"
      ],
      [
        "e",
        "x"
      ],
      [
        "e",
        "mp"
      ],
      [
        "h",
        "e"
      ],
      [
        "i",
        "le"
      ],
      [
        "i",
        "me"
      ],
      [
        "l",
        "ed"
      ],
      [
        "n",
        "o"
      ],
      [
        "o",
        "st"
      ],
      [
        "o",
        "ut"
      ],
      [
        "u",
        "e"
      ],
      [
        "u",
        "p"
      ],
      [
        "Ġ",
        "att"
      ],
      [
        "er",
        "s"
      ],
      [
        "en",
        "t"
      ],
      [
        "lo",
        "ad"
      ],
      [
        "Ġc",
        "onnect"
      ],
      [
        "12",
        "3"
      ],
      [
        "as",
        "e"
      ],
      [
        "ER",
        "ROR"
      ],
      [
        "IN",
        "FO"
      ],
      [
        "emp",
        "t"
      ],
      [
        "Ġatt",
        "empt"
      ],
      [
        "\"",
        ":"
      ],
      [
        "(",
        ")"
      ],
      [
        "0",
        "0"
      ],
      [
        "F",
        "ile"
      ],
      [
        "a",
        "g"
      ],
      [
        "a",
        "i"
      ],
      [
        "a",
        "p"
      ],
      [
        "a",
        "r"
      ],
      [
        "a",
        "in"
      ],
      [
        "a",
        "ut"
      ],
      [
        "c",
        "s"
      ],
      [
        "d",
        "at"
      ],
      [
        "h",
        "ost"
      ],
      [
        "i",
        "t"
      ],
      [
        "k",
        "en"
      ],
      [
        "p",
        "y"
      ],
      [
        "p",
        "ort"
      ],
      [
        "t",
        "o"
      ],
      [
        "Ġ",
        "b"
      ],
      [
        "Ġ",
        "f"
      ],
      [
        "Ġ",
        "o"
      ],
      [
        "Ġ",
        "is"
      ],
      [
        "Ġ",
        "user"
      ],
      [
        "Ġ",
        "File"
      ],
      [
        "in",
        "e"
      ],
      [
        "ce",
        "s"
      ],
      [
        "ab",
        "ase"
      ],
      [
        "lo",
        "g"
      ],
      [
        "Ġre",
        "tr"
      ],
      [
        "**",
        "**"
      ],
      [
        "Ġl",
        "ine"
      ],
      [
        "ĠĠ",
        "Ġ"
      ],
      [
        "ime",
        "out"
      ],
      [
        "no",
        "t"
      ],
      [
        "up",
        "load"
      ],
      [
        "ag",
        "e"
      ],
      [
        "ap",
        "p"
      ],
      [
        "aut",
        "h"
      ],
      [
        "3",
        "2"
      ],
      [
        "3",
        "3"
      ],
      [
        "4",
        "32"
      ],
      [
        "5",
        "432"
      ],
      [
        "6",
        "00"
      ],
      [
        "A",
        "R"
      ],
      [
        "B",
        "U"
      ],
      [
        "C",
        "on"
      ],
      [
        "D",
        "E"
      ],
      [
        "T",
        "ra"
      ],
      [
        "T",
        "imeout"
      ],
      [
        "W",
        "AR"
      ],
      [
        "a",
        "ra"
      ],
      [
        "a",
        "mp"
      ],
      [
        "c",
        "at"
      ],
      [
        "c",
        "ac"
      ],
      [
        "d",
        "e"
      ],
      [
        "e",
        "e"
      ],
      [
        "f",
        "i"
      ],
      [
        "g",
        "ra"
      ],
      [
        "i",
        "z"
      ],
      [
        "n",
        "s"
      ],
      [
        "n",
        "al"
      ],
      [
        "p",
        "h"
      ],
      [
        "p",
        "on"
      ],
      [
        "p",
        "as"
      ],
      [
        "q",
        "ue"
      ],
      [
        "s",
        "u"
      ],
      [
        "s",
        "w"
      ],
      [
        "s",
        "pon"
      ],
      [
        "t",
        "l"
      ],
      [
        "t",
        "er"
      ],
      [
        "v",
        "ar"
      ],
      [
        "y",
        "in"
      ],
      [
        "Ġ",
        "'"
      ],
      [
        "Ġ",
        "/"
      ],
      [
        "Ġ",
        "S"
      ],
      [
        "Ġ",
        "w"
      ],
      [
        "Ġ",
        "al"
      ],
      [
        "Ġ",
        "ex"
      ],
      [
        "Ġ",
        "not"
      ],
      [
        "at",
        "abase"
      ],
      [
        "or",
        "d"
      ],
      [
        "re",
        "port"
      ],
      [
        "Ġs",
        "h"
      ],
      [
        "Ġs",
        "ee"
      ],
      [
        "Ġt",
        "ra"
      ],
      [
        "ab",
        "c"
      ],
      [
        "Ġc",
        "al"
      ],
      [
        "Ġm",
        "ain"
      ],
      [
        "Ġre",
        "spon"
      ],
      [
        "Ġp",
        "ara"
      ],
      [
        "Ġd",
        "id"
      ],
      [
        "Ġto",
        "ken"
      ],
      [
        "ac",
        "k"
      ],
      [
        "Ġconnect",
        "ion"
      ],
      [
        "ai",
        "led"
      ],
      [
        "cs",
        "v"
      ],
      [
        "dat",
        "a"
      ],
      [
        "Ġo",
        "f"
      ],
      [
        "log",
        "in"
      ],
      [
        "Ġretr",
        "yin"
      ],
      [
        "upload",
        "s"
      ],
      [
        "BU",
        "G"
      ],
      [
        "DE",
        "BUG"
      ],
      [
        "Timeout",
        "Error"
      ],
      [
        "WAR",
        "N"
      ],
      [
        "cac",
        "he"
      ],
      [
        "gra",
        "ph"
      ],
      [
        "pas",
        "sw"
      ],
      [
        "que",
        "st"
      ],
      [
        "Ġrespon",
        "d"
      ],
      [
        "Ġpara",
        "graph"
      ],
      [
        "Ġtoken",
        "iz"
      ],
      [
        "Ġretryin",
        "g"
      ],
      [
        "passw",
        "ord"
      ]
    ]
  }
}